tutorial_cases/OF9/bubble_column_20L/constant/thermophysicalProperties_erroneous.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format    ascii;
    class    dictionary;
    location    "constant";
    object    thermophysicalProperties.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type    heRhoThermo;
    mixture    multiComponentMixture;
    transport    sutherland;
    thermo    janaf;
    equationOfState    perfectGas;
    specie    specie;
    energy    sensibleInternalEnergy;
}

species
(
    O2
    N2
    water
);

defaultSpecie    N2;

O2
{
    specie
    {
        molWeight    31.999;
    }
    thermodynamics
    {
        Tlow    200;
        Thigh    3500;
        Tcommon    1000;
        highCpCoeffs    ( 3.28254 0.00148309 -7.57967e-08 2.09471e-10 -2.16718e-14 -1038.31 5.56079 );
        lowCpCoeffs    ( 3.78246 -0.00299673 9.8473e-06 -9.6813e-09 3.24373e-12 -1063.94 3.65768 );
    }
    transport
    {
        As    1.948e-06;
        Ts    273;
    }
    elements
    {
        O    2;
    }
}

CO2
{
    specie
    {
        molWeight    44.00995;
    }
    thermodynamics
    {
        Tlow    200;
        Thigh    3500;
        Tcommon    1000;
        highCpCoeffs
        (
            3.85746029
            0.00441437026
            -2.21481404e-06
            5.23490188e-10
            -4.72084164e-14
            -48759.166
            2.27163806
        );
        lowCpCoeffs
        (
            2.35677352
            0.00898459677
            -7.12356269e-06
            2.45919022e-09
            -1.43699548e-13
            -48371.9697
            9.90105222
        );
    }
    transport
    {
        As    1.652e-06;
        Ts    273;
    }
    elements
    {
        C    1;
        O    2;
    }
}

water
{
    specie
    {
        molWeight    18.0153;
    }
    thermodynamics
    {
        Tlow    200;
        Thigh    3500;
        Tcommon    1000;
        highCpCoeffs    ( 3.03399249 0.00217691804 -1.64072518e-07 -9.7041987e-11 1.68200992e-14 -30004.2971 4.9667701 );
        lowCpCoeffs    ( 4.19864056 -0.0020364341 6.52040211e-06 -5.48797062e-09 1.77197817e-12 -30293.7267 -0.849032208 );
    }
    transport
    {
        As    1.456e-06;
        Ts    273;
    }
    elements
    {
        H    2;
        O    1;
    }
}

N2
{
    specie
    {
        molWeight    28.0134;
    }
    thermodynamics
    {
        Tlow    250;
        Thigh    5000;
        Tcommon    1000;
        highCpCoeffs    ( 2.92664 0.0014879768 -5.68476e-07 1.0097038e-10 -6.753351e-15 -922.7977 5.980528 );
        lowCpCoeffs    ( 3.298677 0.0014082404 -3.963222e-06 5.641515e-09 -2.444854e-12 -1020.8999 3.950372 );
    }
    transport
    {
        As    1.512e-06;
        Ts    120;
    }
    elements
    {
        N    2;
    }
}

H2
{
    specie
    {
        molWeight    2.01594;
    }
    thermodynamics
    {
        Tlow    200;
        Thigh    3500;
        Tcommon    1000;
        highCpCoeffs
        (
            3.3372792
            -4.94024731e-05
            4.99456778e-07
            -1.79566394e-10
            2.00255376e-14
            -950.158922
            -3.20502331
        );
        lowCpCoeffs
        (
            2.34433112
            0.00798052075
            -1.9478151e-05
            2.01572094e-08
            -7.37611761e-12
            -917.935173
            0.683010238
        );
    }
    transport
    {
        As    8.024e-07;
        Ts    273;
    }
    elements
    {
        H    2;
    }
}

// ************************************************************************* //
